bscms/plugins/blog/src/Http/Controllers/PostController.php

select * from `posts` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `posts`
---
    public function getWidgetRecentPosts(Request $request, BaseHttpResponse $response)
    {
        $limit = $request->input('paginate', 10);
        $posts = $this->postRepository->getModel()->orderBy('created_at', 'desc')->paginate($limit);