bscms/plugins/slider/src/Repositories/Eloquent/SliderRepository.php

    function get_slider()
    {
        $data = $this->model
            ->where([
                'sliders.status' => 1,
            ])
            ->orderBy('sliders.created_at', 'desc');
---
select * from `sliders` where (`sliders`.`status` = '1') and `sliders`.`deleted_at` is null order by `sliders`.`created_at` desc