bscms/plugins/review/src/Repositories/Eloquent/ReviewRepository.php

    function getReview()
    {
        $data = $this->model
            ->where([
                'reviews.status' => 1
            ])
            ->orderBy('reviews.created_at', 'desc');
---
select * from `reviews` where (`reviews`.`status` = '1') order by `reviews`.`created_at` desc