bscms/plugins/audit-log/src/Listeners/AuditHandlerListener.php

    public function handle(AuditHandlerEvent $event)
    {
        if (isset($_SERVER['HTTP_USER_AGENT'])) {
            $this->auditHistory->user_agent = $_SERVER['HTTP_USER_AGENT'];
        }

        if (isset($_SERVER['REMOTE_ADDR'])) {
            $this->auditHistory->ip_address = $_SERVER['REMOTE_ADDR'];
        }

        if ($event->action !== 'loggedin' && $event->action !== 'password') {
            $this->auditHistory->request = json_encode(Request::all());
        }

        $this->auditHistory->module = $event->module;
        $this->auditHistory->action = $event->action;
        $this->auditHistory->user_id = Auth::user()->getKey();
        $this->auditHistory->reference_user = $event->reference_user;
        $this->auditHistory->reference_id = $event->reference_id;
        $this->auditHistory->reference_name = $event->reference_name;
        $this->auditHistory->type = $event->type;

        $this->auditHistory->save();
---
insert into `audit_history` (`user_agent`, `ip_address`, `request`, `module`, `action`, `user_id`, `reference_user`, `reference_id`, `reference_name`, `type`, `updated_at`, `created_at`) values ('Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.67 Safari/537.36', '127.0.0.1', '{\"_token\":\"X4da7b1L6hObZSu6Za57YUt4In7Mh55MbMZp9rAi\",\"name\":\"NGHI\u00caN C\u1ee8U N\u1ed8I DUNG\",\"description\":\"Ph\u00e2n t\u00edch r\u00f5 r\u00e0ng m\u1ee5c \u0111\u00edch, y\u00eau c\u1ea7u, nguy\u1ec7n v\u1ecdng kh\u00e0ch h\u00e0ng. L\u1eadp k\u1ebf ho\u1ea1ch th\u1ef1c hi\u1ec7n d\u1ef1 \u00e1n.\",\"content\":\"<p>Ph&acirc;n t&iacute;ch r&otilde; r&agrave;ng m\u1ee5c \u0111&iacute;ch, y&ecirc;u c\u1ea7u, nguy\u1ec7n v\u1ecdng kh&agrave;ch h&agrave;ng. L\u1eadp k\u1ebf ho\u1ea1ch th\u1ef1c hi\u1ec7n d\u1ef1 &aacute;n.&nbsp;Ph&acirc;n t&iacute;ch r&otilde; r&agrave;ng m\u1ee5c \u0111&iacute;ch, y&ecirc;u c\u1ea7u, nguy\u1ec7n v\u1ecdng kh&agrave;ch h&agrave;ng. L\u1eadp k\u1ebf ho\u1ea1ch th\u1ef1c hi\u1ec7n d\u1ef1 &aacute;n.<\/p>\",\"submit\":\"save\",\"order\":null,\"image\":\"\/uploads\/1\/icon-service1.gif\",\"status\":\"1\"}', 'svprocess', 'updated', '1', '1', '2', 'NGHIÊN CỨU NỘI DUNG', 'primary', '2018-11-11 19:13:59', '2018-11-11 19:13:59')