bscms/plugins/contacts/src/Http/Controllers/ContactsController.php

insert into `contacts` (`name`, `email`, `theme`, `message`, `updated_at`, `created_at`) values ('Bằng', 'computerpokemon@yahoo.com', 'fdfd', 'cvbvbv', '2018-11-11 20:52:13', '2018-11-11 20:52:13')
---
    public function addContact(Request $request)
    {
            $rules = [
            'email' =>'required|email',
            'name' => 'required',
            'message'=> 'required',
            'theme' => 'required',

        ];
        $messages = [
            'email.required' => 'Email là trường bắt buộc',
            'email.email' => 'Email không đúng định dạng',
            'message.required' => 'Tin Nhắn là trường bắt buộc',
            'theme.required' => 'Chủ Đề  là trường bắt buộc',
            'name.required' => 'Tên là trường bắt buộc',

        ];
        $validator = Validator::make($request->all(), $rules, $messages);
        if ($validator->fails()) {
            return redirect('/lien-he')->withErrors($validator)->withInput();
        }
        else {
            $contact = new Contacts();
            $contact->name    = $request->input('name');
            $contact->email   = $request->input('email');
            $contact->theme   = $request->input('theme');
            $contact->message = $request->input('message');
            $contact->save();