bscms/plugins/request-log/src/Listeners/RequestHandlerListener.php

update `request_logs` set `count` = '12', `updated_at` = '2018-11-11 15:30:15' where `id` = '2'
---
            $this->requestLog->count += 1;
        }

        return $this->requestLog->save();