bscms/plugins/audit-log/src/Http/Controllers/AuditLogController.php

select * from `users` where `users`.`id` in ('1')
---
    public function getWidgetActivities(BaseHttpResponse $response)
    {
        $limit = request()->input('paginate', 10);
        $histories = $this->auditLogRepository
            ->getModel()
            ->with('user')
            ->orderBy('created_at', 'desc')
            ->paginate($limit);