bscms/plugins/svprocess/src/Repositories/Eloquent/SvprocessRepository.php

select `svprocesses`.* from `svprocesses` where `svprocesses`.`status` = '1' order by `svprocesses`.`order` desc limit 4
---
    function getSvprocess($limit = 4)
    {
        $data = $this->model
            ->where('svprocesses.status', '=', 1)
            ->select('svprocesses.*')
            ->limit($limit)
            ->orderBy('svprocesses.order', 'asc');
        return $this->applyBeforeExecuteQuery($data, $this->screen)->get();